# DeleteCDATA

## Description
Deletes a CDATA section

```pascal
FUNCTION DeleteCDATA(
				XMLHandle   : LONGINT;
				elementPath : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.DeleteCDATA(XMLHandle, elementPath):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|elementPath|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML